{
  "query": "trump vs. china",
  "timestamp": "2025-04-14T08:30:52.701410",
  "results": [
    {
      "title": "Why Trump's War With China is Much Bigger Than Trade",
      "link": "https://www.newsweek.com/china-us-trade-tariffs-war-nuclear-trump-2058433",
      "description": "By 2023, China's exports to the United States were barely 13 percent of its total exports, compared to nearly 20 percent when Trump was elected in 2016. Its imports had slipped to 7 percent from ..."
    },
    {
      "title": "Why Trump is hitting China on trade - and what might happen next - BBC",
      "link": "https://www.bbc.com/news/articles/c9qwwe9rdwlo",
      "description": "Suddenly, Donald Trump's trade war is in much sharper focus. Rather than a fight on all fronts against the world, this now looks far more like a fight on familiar Trumpian territory: America v China."
    },
    {
      "title": "A Devastating Trade Spat With China Shows Few Signs of Abating",
      "link": "https://www.nytimes.com/2025/04/13/us/politics/trump-tariffs-trade-war-china.html",
      "description": "But there has been little sign of communication between higher-ranking officials in the Trump administration and the Chinese government. Early in Mr. Trump's first term, Mr. Xi flew to his Mar-a ..."
    },
    {
      "title": "In trade war with the US, China holds a lot more cards than Trump may ...",
      "link": "https://theconversation.com/in-trade-war-with-the-us-china-holds-a-lot-more-cards-than-trump-may-think-in-fact-it-might-have-a-winning-hand-254173",
      "description": "On April 11, China dismissed Trump's moves as a \"joke\" and raised its own tariff against the U.S. to 125%. The two economies are now locked in an all-out, high-intensity trade standoff. And ..."
    },
    {
      "title": "Analysis: Donald Trump's tariff onslaught against China launches a ...",
      "link": "https://www.cnn.com/2025/04/09/politics/china-trump-tariffs-trade-war/index.html",
      "description": "Trump's tariff onslaught against China escalates a battle the US may not be able to win Analysis by Stephen Collinson, CNN 9 minute read ..."
    },
    {
      "title": "US-China tariff battle fuels questions about Trump's endgame",
      "link": "https://thehill.com/homenews/administration/5245475-trump-tariff-battle-china/",
      "description": "President Trump's escalating tariff battle with China is rattling the global economy and raising questions about how the standoff will end. Trump this week announced a 90-day pause on his ..."
    },
    {
      "title": "China vows retaliation and a 'fight to the end' after Trump's latest ...",
      "link": "https://www.npr.org/2025/04/07/nx-s1-5355148/china-trump-tariffs-trade-war-retaliation",
      "description": "BEIJING — China said on Tuesday it will not back down in the face of President Trump's fresh threat to impose an additional 50% tariff on Chinese imports, as the trade war between the world's ..."
    },
    {
      "title": "Trump has begun another trade war. Here's a timeline of how we got here",
      "link": "https://apnews.com/article/trump-tariffs-mexico-china-canada-trade-cfe1fa82a47f1bca21a82f4b504486c8",
      "description": "President Joe Biden largely preserves most of the tariffs Trump previously enacted against China, but his administration claims to take a more targeted approach. In October 2022, he issues sweeping new restrictions on selling semiconductors and chipmaking equipment to China."
    },
    {
      "title": "China learned from Trump's first trade war and changed its tactics when ...",
      "link": "https://apnews.com/article/tariffs-china-trump-xi-trade-war-debaa669593271d79658bb8b9ce42572",
      "description": "Beijing, which unlike America's close partners and neighbors has been locked in a trade and tech war with the U.S. for years, is taking a different approach to Trump in his second term, making it clear that any negotiations should be conducted on equal footing."
    },
    {
      "title": "China vows to 'fight till the end' as Trump escalates trade war - CNN",
      "link": "https://www.cnn.com/2025/03/03/china/china-two-sessions-xi-stability-trump-intl-hnk/index.html",
      "description": "China has vowed to \"fight till the end\" after US President Donald Trump escalated his trade war by doubling tariffs on all Chinese imports to 20%."
    }
  ]
}