{
  "query": "what did Donald Trump do with China",
  "timestamp": "2025-04-13T11:35:08.127497",
  "results": [
    {
      "title": "Trump-China tariff war: What could the US gain and lose?",
      "link": "https://www.aljazeera.com/news/2025/4/10/trump-china-tariff-war-what-could-the-us-gain-and-lose",
      "description": "During Trump's first trade war with China in 2018, the US-China Business Council estimated that 245,000 US jobs were lost. As the scope of tariffs is greater today, it's fair to assume that ..."
    },
    {
      "title": "Trump pauses reciprocal tariffs but hikes duties on China to 125%",
      "link": "https://www.nbcnews.com/business/economy/trump-tariffs-president-announces-90-day-pause-what-to-know-rcna200463",
      "description": "President Donald Trump said Wednesday that he is pausing his tariffs plan for 90 days on 75 trading partners who did not retaliate in the hours after it went into effect."
    },
    {
      "title": "Why Trump is hitting China on trade - and what might happen next",
      "link": "https://www.bbc.co.uk/news/articles/c9qwwe9rdwlo",
      "description": "Suddenly, Donald Trump's trade war is in much sharper focus. Rather than a fight on all fronts against the world, this now looks far more like a fight on familiar Trumpian territory: America v China."
    },
    {
      "title": "Tariffs updates: Trump wants China deal, but levies are at 145% - USA TODAY",
      "link": "https://www.usatoday.com/story/news/politics/2025/04/10/trump-tariffs-trade-war-stock-market-live-updates/83008953007/",
      "description": "Trump did not say when asked whether Chinese President Xi Jinping has been in touch with the U.S. to discuss trade policy. \"I don't want to say who's reached out,'' Trump said."
    },
    {
      "title": "In trade war with the US, China holds a lot more cards than Trump may ...",
      "link": "https://theconversation.com/in-trade-war-with-the-us-china-holds-a-lot-more-cards-than-trump-may-think-in-fact-it-might-have-a-winning-hand-254173",
      "description": "U.S. President Donald Trump looks at Chinese President Xi Jinping during the plenary session at the G20 Summit on July 7, 2017, in Hamburg, Germany."
    },
    {
      "title": "Donald Trump's China Connections Explained - Newsweek",
      "link": "https://www.newsweek.com/donald-trump-china-business-connections-tax-returns-2024-1772648",
      "description": "Former President Donald Trump, whose policies on China hardened in his final year in office despite the inking of a historic trade agreement with Beijing, has had extensive commercial..."
    },
    {
      "title": "What Trump Has Promised on China in a Second Term | FRONTLINE - PBS",
      "link": "https://www.pbs.org/wgbh/frontline/article/trump-china-second-term/",
      "description": "President-elect Donald Trump has vowed to take a tough stance on China in his second term. In the new documentary China, the U.S. & the Rise of Xi Jinping, FRONTLINE traces how Trump's..."
    },
    {
      "title": "Donald Trump's Gift to China - The National Interest",
      "link": "https://nationalinterest.org/feature/donald-trumps-gift-to-china",
      "description": "After Donald Trump first took office in 2017, he dramatically expanded the U.S. presence in the Indo-Pacific and initiated new diplomatic projects in the region—most notably the \"Quad ..."
    },
    {
      "title": "How Trump's China Trade War Played Out in His First Term - PBS",
      "link": "https://www.pbs.org/wgbh/frontline/article/donald-trump-china-tariffs-trade-war-xi-jinping-video/",
      "description": "How did Trump's trade war with China, both a major economic rival and trade partner of the U.S., play out during his first presidential administration? The above video offers answers."
    },
    {
      "title": "What Trump's election win means for U.S.-China ties on Taiwan, trade ...",
      "link": "https://www.nbcnews.com/news/world/trade-taiwan-now-trump-china-braces-volatile-new-era-us-ties-rcna179070",
      "description": "Former President Donald Trump's election win over Kamala Harris could increase tensions with China over trade tariffs, Taiwan, technology and more."
    }
  ]
}